Repository: CodyBontecou/GitSync.md
Catalog: Sync.md/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, he, hi, hu, id, it, ja, ko, nb, nl, pl, pt_br, ru, sv, th, tr, uk, vi, zh_hans, zh_hant

source: Background Sync attempts pull-only updates when iOS grants background time. One installation-level opt-in covers every current and future cloned or managed repository unless you exclude it in Repository Settings. GitHub repositories covered by linked GitHub App installations get best-effort wake hints; non-GitHub or unresolved repositories sync only while the app is open. Pulls remain clean fast-forward only. Local changes, divergence, the wrong branch, or authentication and trust requirements stop the update.
ar: يحاول Background Sync إجراء تحديثات بنمط pull فقط عندما يمنح iOS وقتًا للعمل في الخلفية. تشمل موافقة واحدة على مستوى التثبيت كل مستودع حالي ومستقبلي مستنسخ أو مُدار، ما لم تستثنه في إعدادات المستودع. تحصل مستودعات GitHub التي تشملها عمليات تثبيت GitHub App المرتبطة على تلميحات تنبيه بأفضل جهد؛ أما المستودعات غير التابعة لـ GitHub أو غير المحسومة فتتزامن فقط عندما يكون التطبيق مفتوحًا. تظل عمليات pull مقتصرة على fast-forward النظيف. وتوقف التحديثَ التغييراتُ المحلية أو التباعد أو الفرع الخطأ أو متطلبات المصادقة والثقة.
da: Background Sync forsøger at udføre opdateringer udelukkende med pull, når iOS tildeler baggrundstid. Ét tilvalg på installationsniveau dækker alle nuværende og fremtidige klonede eller administrerede arkiver, medmindre du undtager dem i Indstillinger for arkiv. GitHub-arkiver, der er dækket af tilknyttede GitHub App-installationer, får vækningssignaler efter bedste evne. Arkiver, der ikke er fra GitHub eller ikke kan identificeres, synkroniseres kun, mens appen er åben. Pull forbliver begrænset til ren fast-forward. Lokale ændringer, divergens, den forkerte branch eller krav om godkendelse og tillid stopper opdateringen.
de: Background Sync versucht Aktualisierungen ausschließlich per pull, wenn iOS Hintergrundzeit gewährt. Eine installationsweite Zustimmung gilt für jedes aktuelle und zukünftige geklonte oder verwaltete Repository, sofern Sie es nicht in den Repository-Einstellungen ausschließen. GitHub-Repositorys, die mit verknüpften GitHub App-Installationen abgedeckt sind, erhalten Wake-Hinweise nach bestem Bemühen. Repositorys außerhalb von GitHub oder nicht aufgelöste Repositorys werden nur bei geöffneter App synchronisiert. pull-Vorgänge bleiben auf sauberes fast-forward beschränkt. Lokale Änderungen, Abweichungen, der falsche Branch oder Anforderungen an Authentifizierung und Vertrauensstellung stoppen die Aktualisierung.
es: Background Sync intenta aplicar actualizaciones solo mediante pull cuando iOS concede tiempo en segundo plano. Una única autorización por instalación abarca todos los repositorios clonados o gestionados, actuales y futuros, salvo que los excluya en Ajustes del repositorio. Los repositorios de GitHub cubiertos por instalaciones vinculadas de GitHub App reciben avisos de activación sin garantías; los repositorios que no sean de GitHub o no estén identificados solo se sincronizan mientras la app está abierta. Solo se realizan pull limpios de tipo fast-forward. Los cambios locales, las divergencias, una rama incorrecta o los requisitos de autenticación y confianza detienen la actualización.
fi: Background Sync yrittää tehdä vain pull-päivityksiä, kun iOS myöntää tausta-aikaa. Yksi asennuskohtainen suostumus kattaa kaikki nykyiset ja tulevat kloonatut tai hallitut tietovarastot, ellet sulje niitä pois tietovaraston asetuksissa. Linkitettyjen GitHub App -asennusten kattamat GitHub-tietovarastot saavat parhaaseen yritykseen perustuvia herätysvihjeitä. Muut kuin GitHub-tietovarastot ja tunnistamattomat tietovarastot synkronoidaan vain sovelluksen ollessa avoinna. Vain puhtaat fast-forward pull -toiminnot sallitaan. Paikalliset muutokset, haarautuminen, väärä haara tai todennus- ja luottamusvaatimukset pysäyttävät päivityksen.
fr: Background Sync tente d’appliquer des mises à jour uniquement par pull lorsqu’iOS accorde du temps d’exécution en arrière-plan. Un seul consentement par installation couvre tous les dépôts clonés ou gérés, actuels et futurs, sauf ceux que vous excluez dans les réglages du dépôt. Les dépôts GitHub couverts par des installations GitHub App liées reçoivent des indications de réveil sans garantie ; les dépôts hors GitHub ou non identifiés se synchronisent uniquement lorsque l’app est ouverte. Seuls des pull propres de type fast-forward sont effectués. Les modifications locales, les divergences, une branche incorrecte ou les exigences d’authentification et de confiance interrompent la mise à jour.
he: Background Sync מנסה לבצע עדכוני pull בלבד כאשר iOS מקצה זמן לפעילות ברקע. הסכמה אחת ברמת ההתקנה חלה על כל מאגר נוכחי ועתידי ששוכפל או מנוהל, אלא אם הוא מוחרג בהגדרות המאגר. מאגרי GitHub המכוסים בהתקנות GitHub App מקושרות מקבלים רמזי התעוררות במאמץ מיטבי; מאגרים שאינם ב-GitHub או שלא זוהו מסתנכרנים רק כשהיישום פתוח. פעולות pull נשארות נקיות ובמצב fast-forward בלבד. שינויים מקומיים, התפצלות, ענף שגוי או דרישות אימות ואמון עוצרים את העדכון.
hi: iOS से बैकग्राउंड समय मिलने पर Background Sync केवल pull वाले अपडेट करने की कोशिश करता है। इंस्टॉलेशन स्तर पर एक बार सहमति देने से हर मौजूदा और भावी क्लोन या प्रबंधित रिपॉज़िटरी शामिल हो जाती है, जब तक कि उसे रिपॉज़िटरी सेटिंग्स में बाहर न रखा जाए। लिंक किए गए GitHub App इंस्टॉलेशन के अंतर्गत आने वाली GitHub रिपॉज़िटरी को यथासंभव वेक संकेत मिलते हैं; गैर-GitHub या अनसुलझी रिपॉज़िटरी केवल ऐप खुला रहने पर सिंक होती हैं। pull केवल साफ़ fast-forward रहता है। स्थानीय बदलाव, विचलन, गलत ब्रांच या प्रमाणीकरण और भरोसे की आवश्यकताएँ अपडेट रोक देती हैं।
hu: A Background Sync csak pull típusú frissítésekkel próbálkozik, amikor az iOS háttéridőt biztosít. Egyetlen, telepítésszintű engedélyezés minden jelenlegi és jövőbeli klónozott vagy kezelt tárolóra érvényes, kivéve a Tárolóbeállításokban kizárt tárolókat. A kapcsolt GitHub App-telepítésekhez tartozó GitHub-tárolók lehetőség szerint ébresztési jelzéseket kapnak; a nem GitHub-alapú és a nem feloldott tárolók csak nyitott alkalmazás mellett szinkronizálódnak. A pull műveletek kizárólag tiszta fast-forward műveletek maradnak. A helyi módosítások, az eltérés, a nem megfelelő ág, valamint a hitelesítési vagy megbízhatósági követelmények leállítják a frissítést.
id: Background Sync mencoba pembaruan khusus pull saat iOS memberikan waktu latar belakang. Satu persetujuan di tingkat instalasi mencakup setiap repositori saat ini dan mendatang yang dikloning atau dikelola, kecuali jika Anda mengecualikannya di Pengaturan Repositori. Repositori GitHub yang tercakup oleh instalasi GitHub App tertaut mendapat petunjuk bangun upaya terbaik; repositori non-GitHub atau yang belum dikenali hanya disinkronkan saat aplikasi terbuka. pull tetap terbatas pada fast-forward yang bersih. Perubahan lokal, divergensi, branch yang salah, atau persyaratan autentikasi dan kepercayaan menghentikan pembaruan.
it: Background Sync tenta aggiornamenti di solo pull quando iOS concede tempo in background. Un’unica adesione a livello di installazione copre tutti i repository clonati o gestiti, presenti e futuri, a meno che non li escluda nelle Impostazioni repository. I repository GitHub coperti da installazioni GitHub App collegate ricevono segnali di riattivazione best effort; i repository non GitHub o non risolti si sincronizzano solo mentre l’app è aperta. I pull restano esclusivamente fast-forward puliti. Modifiche locali, divergenze, il branch errato o requisiti di autenticazione e attendibilità interrompono l’aggiornamento.
ja: Background Sync は、iOS からバックグラウンド実行時間が与えられたときに pull のみの更新を試みます。インストール単位で一度オプトインすれば、リポジトリ設定で除外しない限り、現在および今後のクローン済みまたは管理対象のすべてのリポジトリが対象になります。リンク済みの GitHub App インストールの対象となる GitHub リポジトリには、ベストエフォートの起動通知が送られます。GitHub 以外または未解決のリポジトリは、アプリが開いている間のみ同期されます。pull はクリーンな fast-forward に限られます。ローカルでの変更、分岐、異なる branch、認証または信頼の要件がある場合、更新は停止します。
ko: Background Sync는 iOS에서 백그라운드 실행 시간을 허용할 때 pull 전용 업데이트를 시도합니다. 저장소 설정에서 제외하지 않는 한, 설치 단위로 한 번 동의하면 현재 및 향후에 복제하거나 관리하는 모든 저장소에 적용됩니다. 연결된 GitHub App 설치가 적용되는 GitHub 저장소에는 최선형 깨우기 힌트가 제공되며, GitHub 이외의 저장소나 확인되지 않은 저장소는 앱이 열려 있을 때만 동기화됩니다. pull은 항상 깨끗한 fast-forward로만 수행됩니다. 로컬 변경 사항, 분기, 잘못된 브랜치 또는 인증 및 신뢰 요구 사항이 있으면 업데이트가 중단됩니다.
nb: Background Sync forsøker oppdateringer kun med pull når iOS gir tid i bakgrunnen. Ett samtykke per installasjon dekker alle nåværende og fremtidige klonede eller administrerte repositorier, med mindre du utelater dem i Repositorieinnstillinger. GitHub-repositorier som dekkes av tilknyttede GitHub App-installasjoner, får oppvåkningsvarsler etter beste evne. Repositorier som ikke er på GitHub eller ikke kan identifiseres, synkroniseres bare mens appen er åpen. pull er alltid en ren fast-forward. Lokale endringer, avvik, feil branch eller krav til autentisering og klarering stopper oppdateringen.
nl: Background Sync probeert updates uitsluitend via pull uit te voeren wanneer iOS achtergrondtijd toekent. Eén toestemming per installatie geldt voor elke huidige en toekomstige gekloonde of beheerde repository, tenzij u deze uitsluit in Repository-instellingen. GitHub-repository's die onder gekoppelde GitHub App-installaties vallen, krijgen naar beste vermogen weksignalen; niet-GitHub- of niet-herkende repository's synchroniseren alleen wanneer de app geopend is. pull blijft beperkt tot een schone fast-forward. Lokale wijzigingen, divergentie, de verkeerde branch of vereisten voor authenticatie en vertrouwen stoppen de update.
pl: Background Sync próbuje wykonywać aktualizacje wyłącznie przez pull, gdy iOS przydzieli czas na działanie w tle. Jedna zgoda na poziomie instalacji obejmuje każde obecne i przyszłe sklonowane lub zarządzane repozytorium, chyba że zostanie ono wykluczone w ustawieniach repozytorium. Repozytoria GitHub objęte połączonymi instalacjami GitHub App otrzymują w miarę możliwości sygnały wybudzenia; repozytoria spoza GitHub lub nierozpoznane synchronizują się tylko przy otwartej aplikacji. Operacje pull zawsze są czystymi operacjami fast-forward. Lokalne zmiany, rozbieżność, niewłaściwa gałąź albo wymagania dotyczące uwierzytelnienia lub zaufania zatrzymują aktualizację.
pt_br: O Background Sync tenta fazer atualizações somente por pull quando o iOS concede tempo em segundo plano. Uma única adesão por instalação abrange todos os repositórios clonados ou gerenciados, atuais e futuros, a menos que você os exclua nos Ajustes do Repositório. Repositórios do GitHub abrangidos por instalações vinculadas do GitHub App recebem, na medida do possível, sinais de ativação; repositórios que não são do GitHub ou não foram identificados sincronizam somente enquanto o app está aberto. Os pulls são sempre limpos e apenas fast-forward. Alterações locais, divergência, branch incorreta ou requisitos de autenticação e confiança interrompem a atualização.
ru: Background Sync пытается выполнять обновления только через pull, когда iOS предоставляет время для фоновой работы. Одно согласие на уровне установки распространяется на все текущие и будущие клонированные или управляемые репозитории, если они не исключены в настройках репозитория. Репозитории GitHub, охваченные связанными установками GitHub App, по мере возможности получают сигналы пробуждения; репозитории вне GitHub и нераспознанные репозитории синхронизируются только при открытом приложении. Операции pull всегда выполняются чисто и только методом fast-forward. Локальные изменения, расхождение, неверная ветка либо требования аутентификации или доверия останавливают обновление.
sv: Background Sync försöker utföra uppdateringar enbart med pull när iOS tilldelar bakgrundstid. Ett val på installationsnivå omfattar alla aktuella och framtida klonade eller hanterade arkiv, om du inte undantar dem i Arkivinställningar. GitHub-arkiv som omfattas av länkade GitHub App-installationer får väckningssignaler efter bästa förmåga; arkiv som inte finns på GitHub eller inte kan identifieras synkroniseras bara medan appen är öppen. Endast rena fast-forward-pull genomförs. Lokala ändringar, avvikelser, fel branch eller krav på autentisering och förtroende stoppar uppdateringen.
th: Background Sync จะพยายามอัปเดตด้วย pull เท่านั้นเมื่อ iOS จัดสรรเวลาในเบื้องหลัง การเลือกเข้าร่วมครั้งเดียวในระดับการติดตั้งจะครอบคลุมคลังที่โคลนหรือจัดการทั้งหมดทั้งในปัจจุบันและอนาคต เว้นแต่คุณจะยกเว้นในตั้งค่าคลัง คลัง GitHub ที่ครอบคลุมโดยการติดตั้ง GitHub App ที่เชื่อมโยงจะได้รับสัญญาณปลุกเท่าที่ระบบทำได้ ส่วนคลังที่ไม่ใช่ GitHub หรือระบุไม่ได้จะซิงค์เฉพาะขณะเปิดแอป การ pull จะเป็นแบบ fast-forward ที่ไม่มีข้อขัดแย้งเท่านั้น การเปลี่ยนแปลงในเครื่อง ประวัติที่แยกออกจากกัน branch ไม่ถูกต้อง หรือข้อกำหนดด้านการตรวจสอบสิทธิ์และความน่าเชื่อถือจะหยุดการอัปเดต
tr: Background Sync, iOS arka plan süresi verdiğinde yalnızca pull güncellemelerini dener. Kurulum düzeyinde tek bir onay, Depo Ayarları'nda hariç tuttuklarınız dışında mevcut ve gelecekteki tüm klonlanmış veya yönetilen depoları kapsar. Bağlı GitHub App kurulumlarının kapsadığı GitHub depoları, mümkün olan en iyi şekilde uyandırma ipuçları alır; GitHub dışındaki veya çözümlenmemiş depolar yalnızca uygulama açıkken eşzamanlanır. Yalnızca temiz fast-forward pull işlemleri yapılır. Yerel değişiklikler, ayrışma, yanlış branch ya da kimlik doğrulama ve güven gereksinimleri güncellemeyi durdurur.
uk: Background Sync намагається виконувати лише pull оновлень, коли iOS надає фоновий час. Одна згода на рівні інсталяції охоплює всі поточні й майбутні клоновані або керовані репозиторії, якщо їх не виключено в налаштуваннях репозиторію. Для репозиторіїв GitHub, охоплених пов’язаними інсталяціями GitHub App, надсилаються сигнали пробудження за принципом максимально можливого; репозиторії не з GitHub або нерозпізнані репозиторії синхронізуються лише у відкритому застосунку. Виконуються лише чисті pull типу fast-forward. Локальні зміни, розбіжність, неправильна гілка або вимоги автентифікації чи довіри зупиняють оновлення.
vi: Background Sync cố gắng thực hiện các bản cập nhật chỉ bằng pull khi iOS cấp thời gian chạy nền. Một lần chọn tham gia ở cấp độ bản cài đặt sẽ áp dụng cho mọi kho lưu trữ đã sao chép hoặc được quản lý, cả hiện tại lẫn tương lai, trừ khi bạn loại trừ kho đó trong phần Cài đặt kho lưu trữ. Các kho lưu trữ GitHub thuộc phạm vi cài đặt GitHub App đã liên kết sẽ nhận được tín hiệu đánh thức theo khả năng tốt nhất; các kho lưu trữ không thuộc GitHub hoặc chưa phân giải chỉ đồng bộ khi ứng dụng đang mở. Chỉ thực hiện các thao tác pull sạch kiểu fast-forward. Thay đổi cục bộ, trạng thái phân kỳ, nhánh không đúng hoặc yêu cầu xác thực và tin cậy sẽ dừng quá trình cập nhật.
zh_hans: 当 iOS 授予后台运行时间时，Background Sync 会尝试仅 pull 更新。安装级的一次选择加入会涵盖当前及未来的每个克隆或管理的仓库，除非您在“仓库设置”中将其排除。由已关联 GitHub App 安装涵盖的 GitHub 仓库会获得尽力而为的唤醒提示；非 GitHub 仓库或未解析的仓库仅在应用打开时同步。pull 仍仅限无冲突的 fast-forward。存在本地更改、分支分歧、检出错误分支，或需要身份验证和信任确认时，更新会停止。
zh_hant: 當 iOS 授予背景執行時間時，Background Sync 會嘗試僅 pull 更新。安裝層級的一次加入選擇會涵蓋目前及未來的每個複製或管理的儲存庫，除非您在「儲存庫設定」中將其排除。由已連結 GitHub App 安裝項目涵蓋的 GitHub 儲存庫會獲得盡力而為的喚醒提示；非 GitHub 儲存庫或未解析的儲存庫僅在 App 開啟時同步。pull 仍僅限無衝突的 fast-forward。存在本機變更、分支分歧、簽出錯誤分支，或需要身分驗證和信任確認時，更新會停止。

source: Background Sync can pull safe, fast-forward updates while the app is closed whenever iOS allows background work. GitHub push events provide best-effort wake hints. Optional subscription; all manual features stay included.
ar: يمكن لـ Background Sync تنفيذ pull لتحديثات آمنة بنمط fast-forward أثناء إغلاق التطبيق كلما سمح iOS بالعمل في الخلفية. توفر أحداث push في GitHub تلميحات تنبيه بأفضل جهد. الاشتراك اختياري؛ وتظل جميع الميزات اليدوية متاحة.
da: Background Sync kan udføre pull af sikre fast-forward-opdateringer, mens appen er lukket, når iOS tillader baggrundsarbejde. push-hændelser fra GitHub giver vækningssignaler efter bedste evne. Valgfrit abonnement; alle manuelle funktioner er fortsat inkluderet.
de: Background Sync kann bei geschlossener App sichere fast-forward-Aktualisierungen per pull abrufen, wenn iOS Hintergrundarbeit zulässt. push-Ereignisse von GitHub liefern Wake-Hinweise nach bestem Bemühen. Optionales Abonnement; alle manuellen Funktionen bleiben inbegriffen.
es: Background Sync puede hacer pull de actualizaciones seguras de tipo fast-forward mientras la app está cerrada cuando iOS permite trabajar en segundo plano. Los eventos push de GitHub proporcionan avisos de activación sin garantías. La suscripción es opcional; todas las funciones manuales siguen incluidas.
fi: Background Sync voi tehdä turvallisille fast-forward-päivityksille pull-toiminnon sovelluksen ollessa suljettuna aina, kun iOS sallii taustatyön. GitHubin push-tapahtumat tarjoavat parhaaseen yritykseen perustuvia herätysvihjeitä. Tilaus on valinnainen, ja kaikki manuaaliset ominaisuudet sisältyvät edelleen.
fr: Background Sync peut effectuer un pull de mises à jour sûres de type fast-forward lorsque l’app est fermée et qu’iOS autorise le travail en arrière-plan. Les événements push de GitHub fournissent des indications de réveil sans garantie. L’abonnement est facultatif ; toutes les fonctionnalités manuelles restent incluses.
he: Background Sync יכול לבצע pull של עדכוני fast-forward בטוחים כשהיישום סגור, בכל פעם ש-iOS מאפשר עבודה ברקע. אירועי push של GitHub מספקים רמזי התעוררות במאמץ מיטבי. המינוי אופציונלי; כל התכונות הידניות נשארות כלולות.
hi: iOS के बैकग्राउंड कार्य की अनुमति देने पर Background Sync ऐप बंद रहते हुए सुरक्षित fast-forward अपडेट pull कर सकता है। GitHub push ईवेंट यथासंभव वेक संकेत देते हैं। सदस्यता वैकल्पिक है; सभी मैन्युअल सुविधाएँ शामिल रहती हैं।
hu: A Background Sync biztonságos fast-forward frissítéseket tölthet le pull művelettel bezárt alkalmazás mellett, amikor az iOS engedélyezi a háttérmunkát. A GitHub push eseményei lehetőség szerint ébresztési jelzéseket biztosítanak. Az előfizetés opcionális; minden kézi funkció továbbra is része az alkalmazásnak.
id: Background Sync dapat melakukan pull pembaruan fast-forward yang aman saat aplikasi ditutup setiap kali iOS mengizinkan pekerjaan latar belakang. Peristiwa push GitHub memberikan petunjuk bangun upaya terbaik. Langganan opsional; semua fitur manual tetap disertakan.
it: Background Sync può eseguire il pull di aggiornamenti fast-forward sicuri mentre l’app è chiusa, ogni volta che iOS consente operazioni in background. Gli eventi push di GitHub forniscono segnali di riattivazione best effort. Abbonamento facoltativo; tutte le funzioni manuali restano incluse.
ja: Background Sync は、iOS がバックグラウンド処理を許可したときに、アプリが閉じていても安全な fast-forward 更新を pull できます。GitHub の push イベントはベストエフォートの起動通知を提供します。サブスクリプションは任意で、すべての手動機能は引き続き含まれます。
ko: Background Sync는 iOS에서 백그라운드 작업을 허용할 때마다 앱이 닫혀 있는 동안 안전한 fast-forward 업데이트를 pull할 수 있습니다. GitHub push 이벤트는 최선형 깨우기 힌트를 제공합니다. 선택형 구독이며 모든 수동 기능은 계속 포함됩니다.
nb: Background Sync kan utføre pull av trygge fast-forward-oppdateringer mens appen er lukket, når iOS tillater bakgrunnsarbeid. GitHub push-hendelser gir oppvåkningsvarsler etter beste evne. Valgfritt abonnement. Alle manuelle funksjoner er fortsatt inkludert.
nl: Background Sync kan een pull van veilige fast-forward-updates uitvoeren terwijl de app gesloten is wanneer iOS achtergrondwerk toestaat. GitHub-gebeurtenissen voor push geven naar beste vermogen weksignalen. Optioneel abonnement; alle handmatige functies blijven inbegrepen.
pl: Background Sync może pobierać bezpieczne aktualizacje fast-forward przy zamkniętej aplikacji, gdy iOS zezwala na pracę w tle. Zdarzenia push z GitHub w miarę możliwości dostarczają sygnały wybudzenia. Subskrypcja jest opcjonalna; wszystkie funkcje ręczne pozostają dostępne.
pt_br: O Background Sync pode fazer pull de atualizações seguras e fast-forward com o app fechado sempre que o iOS permite trabalho em segundo plano. Eventos de push do GitHub fornecem sinais de ativação na medida do possível. Assinatura opcional; todos os recursos manuais continuam incluídos.
ru: Background Sync может безопасно выполнять pull обновлений методом fast-forward при закрытом приложении, когда iOS разрешает фоновую работу. События push из GitHub по мере возможности предоставляют сигналы пробуждения. Подписка необязательна; все ручные функции остаются доступными.
sv: Background Sync kan hämta säkra fast-forward-uppdateringar med pull medan appen är stängd när iOS tillåter bakgrundsarbete. GitHub-push-händelser ger väckningssignaler efter bästa förmåga. Valfri prenumeration; alla manuella funktioner ingår fortfarande.
th: Background Sync สามารถทำ pull เพื่อรับการอัปเดตแบบ fast-forward ที่ปลอดภัยขณะปิดแอปเมื่อ iOS อนุญาตให้ทำงานในเบื้องหลัง เหตุการณ์ push ของ GitHub จะส่งสัญญาณปลุกเท่าที่ระบบทำได้ การสมัครใช้เป็นทางเลือก และฟีเจอร์แบบดำเนินการเองทั้งหมดยังคงรวมอยู่
tr: Background Sync, iOS arka planda çalışmaya izin verdiğinde uygulama kapalıyken güvenli fast-forward güncellemelerini pull ile alabilir. GitHub push olayları, mümkün olan en iyi şekilde uyandırma ipuçları sağlar. İsteğe bağlı abonelik; tüm manuel özellikler dahil olmaya devam eder.
uk: Background Sync може безпечно виконувати pull оновлень типу fast-forward, поки застосунок закритий і iOS дозволяє фонову роботу. Події push у GitHub надають сигнали пробудження за принципом максимально можливого. Підписка необов’язкова; усі функції ручної роботи залишаються включеними.
vi: Background Sync có thể pull an toàn các bản cập nhật kiểu fast-forward khi ứng dụng đang đóng, bất cứ khi nào iOS cho phép chạy nền. Các sự kiện push trên GitHub cung cấp tín hiệu đánh thức theo khả năng tốt nhất. Gói đăng ký không bắt buộc; mọi tính năng thủ công vẫn được bao gồm.
zh_hans: 应用关闭时，只要 iOS 允许后台运行，Background Sync 就能以 fast-forward 安全地 pull 更新。GitHub push 事件会提供尽力而为的唤醒提示。订阅可选；所有手动功能仍包含在内。
zh_hant: App 關閉時，只要 iOS 允許背景執行，Background Sync 就能以 fast-forward 安全地 pull 更新。GitHub push 事件會提供盡力而為的喚醒提示。訂閱可選用；所有手動功能仍包含在內。

source: Background Sync could not bind this purchase to the current installation.
ar: تعذر على Background Sync ربط عملية الشراء هذه بالتثبيت الحالي.
da: Background Sync kunne ikke knytte dette køb til den aktuelle installation.
de: Background Sync konnte diesen Kauf nicht mit der aktuellen Installation verknüpfen.
es: Background Sync no ha podido vincular esta compra a la instalación actual.
fi: Background Sync ei voinut liittää tätä ostosta nykyiseen asennukseen.
fr: Background Sync n’a pas pu associer cet achat à l’installation actuelle.
he: Background Sync לא הצליח לשייך רכישה זו להתקנה הנוכחית.
hi: Background Sync इस खरीदारी को मौजूदा इंस्टॉलेशन से नहीं जोड़ सका।
hu: A Background Sync nem tudta ezt a vásárlást a jelenlegi telepítéshez kapcsolni.
id: Background Sync tidak dapat mengaitkan pembelian ini dengan instalasi saat ini.
it: Background Sync non ha potuto associare questo acquisto all’installazione corrente.
ja: Background Sync は、この購入を現在のインストールに関連付けられませんでした。
ko: Background Sync에서 이 구매를 현재 설치에 연결할 수 없습니다.
nb: Background Sync kunne ikke knytte dette kjøpet til den gjeldende installasjonen.
nl: Background Sync kon deze aankoop niet aan de huidige installatie koppelen.
pl: Nie udało się powiązać tego zakupu z bieżącą instalacją Background Sync.
pt_br: O Background Sync não conseguiu vincular esta compra à instalação atual.
ru: Background Sync не удалось связать эту покупку с текущей установкой.
sv: Background Sync kunde inte koppla köpet till den aktuella installationen.
th: Background Sync ไม่สามารถผูกการซื้อนี้กับการติดตั้งปัจจุบันได้
tr: Background Sync bu satın alımı mevcut kurulumla ilişkilendiremedi.
uk: Background Sync не вдалося прив’язати цю покупку до поточної інсталяції.
vi: Background Sync không thể liên kết giao dịch mua này với bản cài đặt hiện tại.
zh_hans: Background Sync 无法将此次购买绑定到当前安装。
zh_hant: Background Sync 無法將這次購買綁定至目前的安裝項目。
